Repository: Balaji-anbu/Feed-the-needy
Catalog: lib/l10n/app_*.arb
Languages: ta

# homeTitle
source: Food Donor Home
ta: பதார்த்த தானியக்க வீட்டில்

source: Welcome, Food Donor!
ta: வரவேற்கின்றேன், உணவு தானியக்கர்!

source: Sign Out
ta: வெளியேறு

# signOutError
source: An error occurred while signing out.
ta: வெளியேறும் போது ஒரு பிழை ஏற்பட்டது.

# drawerHeader
source: Food Donor
ta: உணவு தானியக்கர்

# editProfile
source: Edit
ta: திருத்து

source: Home
ta: முகப்பு

source: Profile
ta: சுயவிவரம்

source: Settings
ta: அமைப்புகள்

# profilePageTitle
source: Profile Page
ta: சுயவிவரப் பக்கம்

source: Name
ta: பெயர்

# organisationType
source: Organization Type
ta: அமைப்பின் வகை

# organisationName
source: Organization Name
ta: அமைப்பின் பெயர்

# doorNo
source: Door Number
ta: வாயிலின் எண்

source: Street
ta: விடுதி

source: Near Where
ta: எங்கே அருகில்

source: City
ta: நகரம்

source: District
ta: சுற்று

source: Pincode
ta: பின்கோடு

source: Email ID
ta: மின்னஞ்சல் ஐடி

source: Phone Number
ta: தொலைபேசி எண்

source: Save Profile
ta: சுயவிவரத்தை சேமி

# profileSaved
source: Profile saved successfully.
ta: சுயவிவரம் வெற்றிகரமாக சேமிக்கப்பட்டது.

# errorSavingProfile
source: Error saving profile. Please try again.
ta: சுயவிவரத்தை சேமிக்கும்போது பிழை ஏற்பட்டது. மறுபடியும் முயற்சிக்கவும்.

# requiredField
source: This field is required.
ta: இந்த களம் தேவையானது.

source: Add Profile
ta: சுயவிவரத்தைச் சேர்க்கவும்

source: Transaction History
ta: பண பரிவர்த்தனை வரலாறு

source: Track Status
ta: நிலைமையைத் தொடர்

source: ISL Chatbot
ta: ISL வட்டார ஆட்டோபோட்

source: Language
ta: மொழி

# helpAndSupport
source: Help & Support
ta: உதவி & ஆதரவு

source: About Us
ta: எங்களைப் பற்றி

source: Logout
ta: பற்றி வெளியேறு

# logoutConfirmation
source: Are you sure you want to logout?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: Rate Us
ta: எங்களை மதிப்பிடுக

source: Mobile Signal Check
ta: கைபேசி சிக்னல் பரிசோதனை

source: UMANG Guide
ta: உமாங் வழிகாட்டி

source: QR Code
ta: QR குறியீடு

# updateProfileCompletion
source: Update your profile to complete registration.
ta: பதிவிடலை முடிக்க உங்கள் சுயவிவரத்தை புதுப்பிக்கவும்.

# profileCompletionStatus
source: Profile Completion: {completion}%
ta: சுயவிவர நிறைவு: {completion}%

source: Vehicle Type
ta: வாகன வகை

source: Vehicle Number
ta: வாகன எண்

source: License Number
ta: அங்கீகாரம் எண்

source: No available orders
ta: ஆர்டர்கள் எதுவும் இல்லை

source: Please log in first
ta: முதலில் உள்நுழையவும்

# activeDeliveryExists
source: You already have an active delivery
ta: உங்களிடம் ஏற்கனவே ஒரு செயலில் உள்ள டெலிவரி உள்ளது

# orderAcceptedSuccess
source: Order Accepted Successfully
ta: ஆர்டர் வெற்றிகரமாக ஏற்கப்பட்டது

# errorAcceptingOrder
source: Error accepting order: {error}
ta: ஆர்டரை ஏற்பதில் பிழை: {error}

source: Order Rejected
ta: ஆர்டர் நிராகரிக்கப்பட்டது

# errorRejectingOrder
source: Error rejecting order: {error}
ta: ஆர்டரை நிராகரிப்பதில் பிழை: {error}

# deliveryIdLabel
source: Delivery Id: {id}
ta: டெலிவரி ஐடி: {id}

# locationLabel
source: Location: {location}
ta: இடம்: {location}

# recipientNameLabel
source: Recipient Name: {name}
ta: பெறுநர் பெயர்: {name}

# quantityLabel
source: Quantity: {quantity}
ta: அளவு: {quantity}

# currentStatusLabel
source: Current Status: {status}
ta: தற்போதைய நிலை: {status}

# doorNoLabel
source: Door No: {doorNo}
ta: கதவு எண்: {doorNo}

# streetNameLabel
source: Street Name: {street}
ta: தெரு பெயர்: {street}

# cityLabel
source: City: {city}
ta: நகரம்: {city}

# pincodeLabel
source: Pincode: {pincode}
ta: பின்கோடு: {pincode}

# paymentModeLabel
source: Payment Mode: {mode}
ta: கட்டண முறை: {mode}

# deliveryChargeLabel
source: Delivery charge: {charge}
ta: டெலிவரி கட்டணம்: {charge}

# recipientPhoneLabel
source: Recipient phone: {phone}
ta: பெறுநர் தொலைபேசி: {phone}

# recipientEmailLabel
source: Recipient Email: {email}
ta: பெறுநர் மின்னஞ்சல்: {email}

source: Accept
ta: ஏற்கவும்

source: Reject
ta: நிராகரிக்கவும்

source: No Completed Orders
ta: முடிக்கப்பட்ட ஆர்டர்கள் எதுவும் இல்லை

# orderId
source: Order ID: {id}
ta: ஆர்டர் ஐடி: {id}

# addressLabel
source: Address:
ta: முகவரி:

# contactDetailsLabel
source: Contact Details:
ta: தொடர்பு விவரங்கள்:

# completedOnLabel
source: Completed On: {date}
ta: முடிக்கப்பட்ட தேதி: {date}

source: No Active Delivery
ta: செயலில் உள்ள டெலிவரி இல்லை

# notifyDeliveryMessage
source: We will Notify you when you get a delivery
ta: உங்களுக்கு டெலிவரி கிடைக்கும்போது அறிவிப்போம்

source: Delivery Progress
ta: டெலிவரி முன்னேற்றம்

# steps
source: {current}/{total} Steps
ta: {current}/{total} படிகள்

# addressDetails
source: Address
ta: முகவரி விவரங்கள்

# cantUpdateStatus
source: Cannot update status further
ta: நிலையை மேலும் புதுப்பிக்க முடியாது

# statusUpdated
source: Status updated to "{status}"
ta: நிலை "{status}" க்கு புதுப்பிக்கப்பட்டது

# errorUpdatingStatus
source: Error updating status: {error}
ta: நிலையை புதுப்பிப்பதில் பிழை: {error}

# cantLaunchMaps
source: Could not launch Google Maps
ta: Google Maps ஐ திறக்க முடியவில்லை

# errorFetchingLocation
source: Error fetching location: {error}
ta: இருப்பிடத்தை பெறுவதில் பிழை: {error}

source: View Food Location
ta: உணவு இருப்பிடத்தைக் காண்க

source: View Delivery Location
ta: டெலிவரி இருப்பிடத்தைக் காண்க

source: Update Status
ta: நிலையை புதுப்பிக்க

# completeAllFields
source: Please complete all required fields
ta: அனைத்து தேவையான புலங்களையும் நிரப்பவும்

source: Capture Photo
ta: புகைப்படம் எடுக்க

source: Additional Notes
ta: கூடுதல் குறிப்புகள்

source: Cancel
ta: ரத்து செய்

# confirm
source: Confirm {action}
ta: {action} உறுதிசெய்

# deliveryPartnerTitle
source: Delivery Partner
ta: டெலிவரி பார்ட்னர்

source: Hey!
ta: வணக்கம்!

source: My Profile
ta: என் சுயவிவரம்

source: View Delivery Details
ta: டெலிவரி விவரங்களைக் காண்க

# errorFetchingDeliveryData
source: Error fetching delivery data: {error}
ta: டெலிவரி தரவைப் பெறுவதில் பிழை: {error}

source: Finished
ta: முடிந்தது

# appVersion
source: App Version {version}
ta: ஆப் பதிப்பு {version}

source: Pending Deliveries
ta: நிலுவையில் உள்ள டெலிவரிகள்

source: Completed Deliveries
ta: முடிக்கப்பட்ட டெலிவரிகள்

# makingDifference
source: Making a Difference
ta: மாற்றத்தை உருவாக்குதல்

# makingDifferenceContent
source: Every delivery ensures food reaches someone in need. You are creating an impact!
ta: ஒவ்வொரு டெலிவரியும் உணவு தேவைப்படுபவர்களை சென்றடைகிறது. நீங்கள் தாக்கத்தை உருவாக்குகிறீர்கள்!

source: Timely Assistance
ta: உரிய நேர உதவி

# timelyAssistanceContent
source: Your dedication ensures food is delivered fresh and on time!
ta: உங்கள் அர்ப்பணிப்பு உணவு புதிதாகவும் சரியான நேரத்திலும் வழங்கப்படுவதை உறுதி செய்கிறது!

source: Building Hope
ta: நம்பிக்கையை கட்டமைத்தல்

# buildingHopeContent
source: By connecting donors and needers, you are building hope for a better tomorrow.
ta: தானியக்கர்களையும் தேவைப்படுபவர்களையும் இணைப்பதன் மூலம், சிறந்த நாளைக்கான நம்பிக்கையை கட்டமைக்கிறீர்கள்.

# whyPartnerMatters
source: Why Being a Delivery Partner Matters?
ta: டெலிவரி பார்ட்னராக இருப்பது ஏன் முக்கியம்?

# partnerRoleDescription
source: As a delivery partner, you play a vital role in bridging the gap between those willing to give and those in need. Your efforts ensure timely delivery of food to the hungry, making an impact one delivery at a time. Your dedication contributes to a hunger-free community.
ta: ஒரு டெலிவரி பார்ட்னராக, கொடுக்க விரும்புபவர்களுக்கும் தேவைப்படுபவர்களுக்கும் இடையே உள்ள இடைவெளியை நிரப்புவதில் முக்கிய பங்கு வகிக்கிறீர்கள். உங்கள் முயற்சிகள் பசியுள்ளவர்களுக்கு உரிய நேரத்தில் உணவு கிடைப்பதை உறுதி செய்கின்றன.

# keyPoints
source: • Connects food to the needy. • Reduces food waste. • Fosters a hunger-free community. • Provides timely assistance. • Helps save lives and build hope.
ta: • தேவைப்படுபவர்களுக்கு உணவை இணைக்கிறது. • உணவு வீணாவதைக் குறைக்கிறது. • பசியற்ற சமூகத்தை வளர

source: Track Your Delivery
ta: உங்கள் டெலிவரியைக் கண்காணிக்கவும்

# noDeliveryDetails
source: No delivery details available.
ta: டெலிவரி விவரங்கள் எதுவும் இல்லை.

source: Delivery Status
ta: டெலிவரி நிலை

source: Order Placed
ta: ஆர்டர் வைக்கப்பட்டது

source: Waiting for Partner
ta: பார்ட்னருக்காக காத்திருக்கிறது

source: Partner Accepted
ta: பார்ட்னர் ஏற்றுக்கொண்டார்

# foodPickedUp
source: Food Picked Up from Donor
ta: உணவு தானியக்கரிடமிருந்து எடுக்கப்பட்டது

source: Out for Delivery
ta: டெலிவரிக்கு புறப்பட்டது

# deliveryInProgressStatus
source: Delivery in Progress
ta: டெலிவரி நடைபெறுகிறது

source: Delivered!
ta: டெலிவர் செய்யப்பட்டது!

source: Contact Delivery Partner
ta: டெலிவரி பார்ட்னரை தொடர்பு கொள்ளவும்

source: Door Delivery Details
ta: கதவு டெலிவரி விவரங்கள்

source: Basic Details
ta: அடிப்படை விவரங்கள்

source: Recipient Name
ta: பெறுநர் பெயர்

source: Enter recipient name
ta: பெறுநர் பெயரை உள்ளிடவும்

source: Recipient Phone Number
ta: பெறுநர் தொலைபேசி எண்

# enterRecipientPhone
source: Enter recipient phone number
ta: பெறுநர் தொலைபேசி எண்ணை உள்ளிடவும்

source: Enter email ID
ta: மின்னஞ்சல் ஐடியை உள்ளிடவும்

source: Enter door number
ta: கதவு எண்ணை உள்ளிடவும்

source: Enter street
ta: தெருவை உள்ளிடவும்

source: Enter city
ta: நகரத்தை உள்ளிடவும்

source: Enter pin code
ta: பின் கோடை உள்ளிடவும்

source: Payment Details
ta: கட்டண விவரங்கள்

source: Delivery Charge: ₹{amount}
ta: டெலிவரி கட்டணம்: ₹{amount}

source: Submit Details
ta: விவரங்களை சமர்ப்பிக்கவும்

# pleaseEnter
source: Please enter {field}.
ta: {field}ஐ உள்ளிடவும்.

source: Delivery Details Submitted!
ta: டெலிவரி விவரங்கள் சமர்ப்பிக்கப்பட்டன!

# errorSavingData
source: Error saving data: {error}
ta: தரவை சேமிப்பதில் பிழை: {error}

source: New Order Available!
ta: புதிய ஆர்டர் கிடைக்கிறது!

# startFindingWay
source: Hurry! Start Finding ur Way Because Someone is waiting for You!
ta: விரைவில்! யாரோ உங்களுக்காக காத்திருக்கிறார்கள், வழியைக் கண்டுபிடிக்க ஆரம்பியுங்கள்!

# availableFoodSearch
source: Search food...
ta: உணவு தேடுக...

# filterLabel
source: Filters
ta: வடிகட்டிகள்

# categoryAll
source: All
ta: அனைத்தும்

source: Clear Filters
ta: வடிகட்டிகளை அழிக்க

source: Apply Filters
ta: வடிகட்டிகளை பயன்படுத்து

# noActiveListings
source: No active listings available.
ta: செயலில் உள்ள பட்டியல்கள் எதுவும் இல்லை.

# searchErrorMessage
source: Error fetching available food: {error}
ta: கிடைக்கக்கூடிய உணவைப் பெறுவதில் பிழை: {error}

# servingsCount
source: {count} Servings
ta: {count} பரிமாறல்கள்

# kmDistance
source: {distance} km
ta: {distance} கி.மீ

source: Confirm Request
ta: கோரிக்கையை உறுதிப்படுத்தவும்

# confirmRequestMessage
source: Are you sure you want to request this food?
ta: இந்த உணவை கோர விரும்புகிறீர்களா?

# requestSentSuccess
source: Request sent successfully
ta: கோரிக்கை வெற்றிகரமாக அனுப்பப்பட்டது

# errorSendingRequest
source: Error sending request: {error}
ta: கோரிக்கையை அனுப்புவதில் பிழை: {error}

# completeProfileFirst
source: Please complete your profile before requesting food
ta: உணவை கோருவதற்கு முன் உங்கள் சுயவிவரத்தை முடிக்கவும்

source: Food Details
ta: உணவு விவரங்கள்

source: Loading address...
ta: முகவரியை ஏற்றுகிறது...

source: Show Donor Details
ta: தானியக்கர் விவரங்களைக் காட்டு

source: Available Food
ta: கிடைக்கக்கூடிய உணவு

source: Claimed Food
ta: கோரப்பட்ட உணவு

source: Active Food Listings
ta: செயலில் உள்ள உணவு பட்டியல்கள்

source: Notifications
ta: அறிவிப்புகள்

# requestApproved
source: Food Request Approved
ta: உணவு கோரிக்கை அங்கீகரிக்கப்பட்டது

# deliveryInProgressMessage
source: Your requested food is on its way.
ta: உங்கள் கோரிய உணவு வழியில் உள்ளது.

source: Untitled
ta: தலைப்பிடப்படாதது

# errorFetchingFood
source: Error fetching available food: {error}
ta: கிடைக்கக்கூடிய உணவைப் பெறுவதில் பிழை: {error}

source: Dashboard
ta: டாஷ்போர்டு

# availableFoodTab
source: Available Food
ta: கிடைக்கக்கூடிய உணவு

source: Your Requests
ta: உங்கள் கோரிக்கைகள்

# neederFoodRequests
source: Food Requests
ta: உணவு கோரிக்கைகள்

source: Needer Home
ta: தேவைப்படுபவர் முகப்பு

source: No active requests
ta: செயலில் உள்ள கோரிக்கைகள் எதுவும் இல்லை

source: Searching for food...
ta: உணவைத் தேடுகிறது...

source: Request Dashboard
ta: கோரிக்கை டாஷ்போர்டு

source: Needy Dashboard
ta: தேவைப்படுபவர் டாஷ்போர்டு

# foodListingsTitle
source: Food Listings
ta: உணவு பட்டியல்கள்

source: No history available
ta: வரலாறு எதுவும் இல்லை

source: Food Listing
ta: உணவு பட்டியல்

# welcomeNeeder
source: Welcome! Home
ta: வரவேற்கின்றோம்! முகப்பு

# neederDashboardTitle
source: Needer Dashboard
ta: உதவி பெறுபவர் டாஷ்போர்டு

# neederAvailableFood
source: Available Food
ta: கிடைக்கக்கூடிய உணவு

# neederRequests
source: Your Requests
ta: உங்கள் கோரிக்கைகள்

# neederDrawerHeader
source: Food Needer
ta: உணவு உதவி பெறுபவர்

source: Needer Profile
ta: சுயவிவரம்

# neederSettings
source: Settings
ta: அமைப்புகள்

source: Track Your Requests
ta: உங்கள் கோரிக்கைகளை கண்காணிக்க

# neederNotifications
source: Notifications
ta: அறிவிப்புகள்

# neederHelp
source: Help & Support
ta: உதவி & ஆதரவு

# appVersionText
source: App Version 1.0.0
ta: செயலி பதிப்பு 1.0.0

# copyrightText
source: Copyright© 2025 Feed The Needy
ta: பதிப்புரிமை© 2025 Feed The Needy

source: Request Details
ta: கோரிக்கை விவரங்கள்

# requestIdLabel
source: Request ID
ta: கோரிக்கை ஐடி

# foodIdLabel
source: Food ID
ta: உணவு ஐடி

# donorIdLabel
source: Donor ID
ta: தானியக்கர் ஐடி

# neederIdLabel
source: Needer ID
ta: தேவைப்படுபவர் ஐடி

# neederNameLabel
source: Needer Name
ta: தேவைப்படுபவர் பெயர்

# createdAtLabel
source: Created At
ta: உருவாக்கப்பட்ட நேரம்

# donorNameLabel
source: Donor Name
ta: தானியக்கர் பெயர்

# organizationNameLabel
source: Organization Name
ta: அமைப்பின் பெயர்

source: Close
ta: மூடு

source: Choose Delivery Option
ta: டெலிவரி விருப்பத்தை தேர்வு செய்யவும்

source: Self Pickup
ta: சுய பிக்கப்

source: Home Delivery
ta: வீட்டு டெலிவரி

source: Track Delivery
ta: டெலிவரியை கண்காணிக்க

source: Invalid delivery ID!
ta: தவறான டெலிவரி ஐடி!

source: Delivery not found!
ta: டெலிவரி கண்டுபிடிக்கப்படவில்லை!

# welcomeToApp
source: Welcome to FeedtheNeedy App
ta: Feed the Needy செயலிக்கு வரவேற்கிறோம்

# welcomeMessage
source: From hotels to hearts—our app bridges the gap with food and compassion.
ta: ஹோட்டல்களில் இருந்து இதயங்களுக்கு—எங்கள் செயலி உணவு மற்றும் கருணையுடன் இடைவெளியை இணைக்கிறது.

# appSlogan
source: One app, countless smiles
ta: ஒரு செயலி, எண்ணற்ற புன்னகைகள்

# sloganMessage
source: Join us in reducing food waste and feeding those in need.
ta: உணவு வீணாவதைக் குறைத்து, தேவைப்படுபவர்களுக்கு உணவளிப்பதில் எங்களுடன் இணையுங்கள்.

# getStarted
source: Get Started Today
ta: இன்றே தொடங்குங்கள்

# getStartedMessage
source: Sign up and choose your role to contribute to the cause.
ta: உங்கள் பங்களிப்பை வழங்க பதிவு செய்து உங்கள் பங்கை தேர்வு செய்யுங்கள்.

source: Verification
ta: சரிபார்ப்பு

# appDescription
source: Reduce food wastage, fight hunger, and build a world where every meal counts.
ta: உணவு வீணாவதைக் குறைத்து, பசியை எதிர்த்துப் போராடி, ஒவ்வொரு உணவும் முக்கியமான உலகை உருவாக்குங்கள்.

source: Enter Phone Number
ta: தொலைபேசி எண்ணை உள்ளிடவும்

# phoneNumberRequired
source: Phone number cannot be empty
ta: தொலைபேசி எண் வெற்றாக இருக்க முடியாது

source: Verification failed
ta: சரிபார்ப்பு தோல்வியடைந்தது

source: Otherwise
ta: அல்லது

source: Continue with Google
ta: Google மூலம் தொடரவும்

source: Enter OTP
ta: OTP ஐ உள்ளிடவும்

# otpScreenTitle
source: Enter OTP
ta: OTP ஐ உள்ளிடவும்

source: Verify OTP
ta: OTP ஐ சரிபார்க்கவும்

# otpEmpty
source: OTP cannot be empty
ta: OTP காலியாக இருக்க முடியாது

# errorVerifyingOtp
source: Error verifying OTP: {error}
ta: OTP சரிபார்ப்பதில் பிழை: {error}

# selectRole
source: Select Your Role
ta: உங்கள் பங்கை தேர்வு செய்யவும்

# whyRoleImportant
source: Why Role Selection Is Important?
ta: பங்கு தேர்வு ஏன் முக்கியம்?

# roleSelectionDesc
source: Role selection is crucial in this app to personalize the user experience and direct them to functionalities tailored to their specific role—Food Donor, Needer, or Delivery Partner. This ensures efficient service delivery and smooth interaction within the platform.
ta: பயனர் அனுபவத்தை தனிப்பயனாக்க மற்றும் அவர்களின் குறிப்பிட்ட பங்குக்கு ஏற்ற செயல்பாடுகளுக்கு வழிகாட்ட இந்த பயன்பாட்டில் பங்கு தேர்வு முக்கியமானது - உணவு தானியக்கர், தேவைப்படுபவர் அல்லது டெலிவரி பார்ட்னர். இது திறமையான சேவை வழங்கல் மற்றும் தளத்தில் சுமூகமான தொடர்பை உறுதி செய்கிறது.

# foodDonorRole
source: Food Donor 💚
ta: உணவு தானியக்கர் 💚

# foodNeederRole
source: Food Needer 🏩️
ta: உணவு தேவைப்படுபவர் 🏩️

# deliveryPartnerRole
source: Delivery Partner 🚚
ta: டெலிவரி பார்ட்னர் 🚚

# cantChangeRole
source: You Can't Change the Role Later
ta: நீங்கள் பிறகு பங்கை மாற்ற முடியாது

source: NOTE:
ta: குறிப்பு:

# confirmRoleTitle
source: Confirm Role Selection
ta: பங்கு தேர்வை உறுதிப்படுத்தவும்

# confirmRoleMessage
source: Are you sure you want to continue as {role}? This action cannot be changed later.
ta: நீங்கள் {role} ஆக தொடர விரும்புகிறீர்களா? இந்த செயலை பின்னர் மாற்ற முடியாது.

source: Yes
ta: ஆம்

# errorOccurred
source: An error occurred while updating your role. Please try again.
ta: உங்கள் பங்கை புதுப்பிக்கும் போது பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

source: Error
ta: பிழை

source: No user logged in
ta: பயனர் உள்நுழையவில்லை

source: Error fetching data
ta: தரவைப் பெறுவதில் பிழை

source: No data available
ta: தரவு எதுவும் இல்லை

source: Profile Completion
ta: சுயவிவர நிறைவு

source: {percent}% Complete
ta: {percent}% நிறைவு

source: Complete Profile
ta: சுயவிவரத்தை நிறைவு செய்யவும்

source: Confirm Sign Out
ta: வெளியேறுவதை உறுதிப்படுத்தவும்

# signOutButton
source: Sign Out
ta: வெளியேறு

source: Total Food Uploads
ta: மொத்த உணவு பதிவேற்றங்கள்

source: Total Served
ta: மொத்தம் வழங்கப்பட்டது

source: People Fed
ta: உணவளித்த மக்கள்

source: Homes/Trusts Fed
ta: உணவளித்த இல்லங்கள்/அறக்கட்டளைகள்

# whyFeedNeedy
source: Why Feed the Needy?
ta: ஏன் தேவைப்படுபவர்களுக்கு உணவளிக்க வேண்டும்?

# feedNeedyDescription
source: Feeding the needy is an act of kindness and generosity that helps ensure no one goes hungry. It not only nourishes those who are struggling but also contributes to a more compassionate and caring society. When we share what we have, we make the world a better place for everyone.
ta: தேவைப்படுபவர்களுக்கு உணவளிப்பது அன்பு மற்றும் கொடையின் செயல், இது யாரும் பசியுடன் இல்லாமல் இருப்பதை உறுதி செய்கிறது. இது போராடுபவர்களுக்கு ஊட்டச்சத்து அளிப்பதோடு மட்டுமல்லாமல், மிகவும் இரக்கமுள்ள மற்றும் அக்கறை கொண்ட சமூகத்திற்கும் பங்களிக்கிறது.

# feedNeedyKeyPoints
source: • Ensures no one goes hungry. • Reduces food waste. • Builds a compassionate community. • Provides a sense of hope and dignity. • Helps create sustainable food systems.
ta: • யாரும் பசியுடன் இல்லாமல் இருப்பதை உறுதி செய்கிறது. • உணவு வீணாவதைக் குறைக்கிறது. • இரக்கமுள்ள சமூகத்தை உருவாக்குகிறது. • நம்பிக்கை மற்றும் கண்ணியத்தை வழங்குகிறது. • நிலையான உணவு அமைப்புகளை உருவாக்க உதவுகிறது.

source: Pending Approval
ta: ஒப்புதலுக்காக காத்திருக்கிறது

# listingDate
source: Dec {date}
ta: டிசம்பர் {date}

source: Upload Food Details
ta: உணவு விவரங்களை பதிவேற்றவும்

source: Food Name
ta: உணவின் பெயர்

source: Food Type
ta: உணவு வகை

source: Food Category
ta: உணவு பிரிவு

source: Food Condition
ta: உணவின் நிலை

source: Packaging Type
ta: பேக்கேஜிங் வகை

source: Serve Within
ta: எவ்வளவு நேரத்திற்குள் பரிமாற வேண்டும்

source: Number of Servings
ta: பரிமாறல்களின் எண்ணிக்கை

# descriptionHint
source: Description(Tell about ur variety of dishes...)
ta: விளக்கம்(உங்கள் உணவு வகைகளைப் பற்றி கூறவும்...)

# whenCooked
source: When was the food cooked?
ta: உணவு எப்போது சமைக்கப்பட்டது?

source: Pick Date & Time
ta: தேதி & நேரத்தை தேர்வு செய்யவும்

# useCurrentGPS
source: Use current GPS address
ta: தற்போதைய GPS முகவரியை பயன்படுத்தவும்

source: Enter manual address
ta: கைமுறை முகவரியை உள்ளிடவும்

source: Fetch Current GPS
ta: தற்போதைய GPS ஐ பெறவும்

# gpsSuccess
source: GPS location fetched successfully!
ta: GPS இருப்பிடம் வெற்றிகரமாக பெறப்பட்டது!

# foodGuidelinesConfirmation
source: I confirm that the food is hygienic, safe to eat, and follows the NGO's donation guidelines.
ta: உணவு சுகாதாரமானது, சாப்பிட பாதுகாப்பானது மற்றும் NGO வின் நன்கொடை வழிகாட்டுதல்களைப் பின்பற்றுகிறது என்று உறுதிப்படுத்துகிறேன்.

source: Upload Food
ta: உணவை பதிவேற்றவும்

# fillAllFields
source: Please fill in all fields and accept the guidelines
ta: அனைத்து புலங்களையும் நிரப்பி வழிகாட்டுதல்களை ஏற்றுக்கொள்ளவும்

# gpsFetchFailed
source: Failed to fetch GPS
ta: GPS ஐ பெற முடியவில்லை

source: GPS location fetched
ta: GPS இருப்பிடம் பெறப்பட்டது

source: Donor Dashboard
ta: தானியக்கர் டாஷ்போர்டு

source: Complete Your Profile
ta: உங்கள் சுயவிவரத்தை நிறைவு செய்யவும்

# profileIncompleteMessage
source: Your profile is incomplete. Please complete your profile to proceed.
ta: உங்கள் சுயவிவரம் முழுமையடையவில்லை. தொடர உங்கள் சுயவிவரத்தை நிறைவு செய்யவும்.

source: Go to Profile
ta: சுயவிவரத்திற்கு செல்லவும்

source: Loading...
ta: ஏற்றுகிறது...

source: Uploaded Food
ta: பதிவேற்றிய உணவு

source: Requests
ta: கோரிக்கைகள்

source: Uploaded Food Detail
ta: பதிவேற்றிய உணவு விவரம்

source: Delete Food
ta: உணவை நீக்கவும்

# selectDeletionReason
source: Select Reason for Deletion
ta: நீக்குவதற்கான காரணத்தை தேர்வு செய்யவும்

source: Food Distributed
ta: உணவு விநியோகிக்கப்பட்டது

source: Food Spoiled
ta: உணவு கெட்டுவிட்டது

source: Not Available
ta: கிடைக்கவில்லை

source: Others
ta: மற்றவை

# foodDeletedSuccess
source: Food item and related requests deleted successfully!
ta: உணவு மற்றும் தொடர்புடைய கோரிக்கைகள் வெற்றிகரமாக நீக்கப்பட்டன!

# deletionCanceled
source: Deletion canceled: No reason selected.
ta: நீக்கம் ரத்து செய்யப்பட்டது: காரணம் எதுவும் தேர்வு செய்யப்படவில்லை.

# loadingUploadedFood
source: Loading your uploaded food...
ta: உங்கள் பதிவேற்றிய உணவை ஏற்றுகிறது...

# signOutConfirmation
source: Are you sure you want to sign out?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: Active Listings
ta: செயலில் உள்ள பட்டியல்கள்

source: Pending Requests
ta: நிலுவையில் உள்ள கோரிக்கைகள்

source: Delivery In Progress
ta: டெலிவரி நடைபெறுகிறது

# cookedAt
source: Cooked At: {datetime}
ta: சமைத்த நேரம்: {datetime}

# doorNumber
source: Door No
ta: கதவு எண்

source: User not authenticated!
ta: பயனர் அங்கீகரிக்கப்படவில்லை

# errorUploadingFood
source: Error uploading food details: {error}
ta: உணவு விவரங்களை பதிவேற்றுவதில் பிழை: {error}

# foodId
source: Food ID: {id}
ta: உணவு ஐடி: {id}

# foodNameLabel
source: Food Name: {name}
ta: உணவின் பெயர்: {name}

# descriptionLabel
source: Description: {description}
ta: விளக்கம்: {description}

# servingsLabel
source: Servings: {count}
ta: பரிமாறல்கள்: {count}

# foodTypeLabel
source: Food Type: {type}
ta: உணவு வகை: {type}

# packageTypeLabel
source: Package Type: {type}
ta: பேக்கேஜிங் வகை: {type}

# foodCategoryLabel
source: Food Category: {category}
ta: உணவு பிரிவு: {category}

# foodConditionLabel
source: Food Condition: {condition}
ta: உணவின் நிலை: {condition}

# cookedAtLabel
source: Cooked At: {time}
ta: சமைத்த நேரம்: {time}

# uploadedAtLabel
source: Uploaded At: {time}
ta: பதிவேற்றிய நேரம்: {time}

# statusLabel
source: Status: {status}
ta: நிலை: {status}

# noFoodUploaded
source: No food uploaded yet
ta: உணவு எதுவும் பதிவேற்றப்படவில்லை
